FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC1788/LPC1788_Serial.c
    *aStatus = (p_info->iUART->MSR & 0xFF);

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine: LPC1788_Serial_GetStatus
 *---------------------------------------------------------------------------*
 * Description:
 *      Return the status of the port
 * Inputs:
 *      void *aWorkspace          -- Serial port workspace
 * Outputs:
 *      T_serialStatusByte          -- Status byte returned
 *---------------------------------------------------------------------------*/
T_serialStatusByte LPC1788_Serial_GetStatus(void *aWorkspace)
{
    T_serialStatusByte status = 0;
    T_Serial_LPC1788_Workspace *p = (T_Serial_LPC1788_Workspace *)aWorkspace;

    // Only empty if both TEMT and THRE are empty
    if (p->iInfo->iUART->LSR & ((1 << 6) | (1 << 5))) {
        // not empty
    } else {
        status |= SERIAL_STATUS_TRANSMIT_EMPTY;
    }

    return status;
}

/*---------------------------------------------------------------------------*
 * Globals:
 *---------------------------------------------------------------------------*/
// List of serial port HAL interfaces
const HAL_Serial G_LPC1788_Serial_UART0 = {
        {
        "Serial:LCP1788 UART0",
        0x0100,
        LPC1788_Serial_InitializeWorkspace_UART0,
        sizeof(T_Serial_LPC1788_Workspace),
        },

        LPC1788_Serial_Configure,
        LPC1788_Serial_SetSerialSettings,
        LPC1788_Serial_GetSerialSettings,
        LPC1788_Serial_Activate,
        LPC1788_Serial_Deactivate,
        LPC1788_Serial_OutputByte,
        0,
        0,
        LPC1788_Serial_GetStatus, };

const HAL_Serial G_LPC1788_Serial_UART1 = {
        {
        "Serial:LCP1788 UART1",
        0x0100,
        LPC1788_Serial_InitializeWorkspace_UART1,
        sizeof(T_Serial_LPC1788_Workspace),
        },

        LPC1788_Serial_Configure,
        LPC1788_Serial_SetSerialSettings,
        LPC1788_Serial_GetSerialSettings,
        LPC1788_Serial_Activate,
        LPC1788_Serial_Deactivate,
        LPC1788_Serial_OutputByte,
        LPC1788_Serial_SetHandshakingControl,
        LPC1788_Serial_GetHandshakingStatus,
        LPC1788_Serial_GetStatus, };

const HAL_Serial G_LPC1788_Serial_UART2 = {
        {
        "Serial:LCP1788 UART2",
        0x0100,
        LPC1788_Serial_InitializeWorkspace_UART2,
        sizeof(T_Serial_LPC1788_Workspace),
        },

        LPC1788_Serial_Configure,
        LPC1788_Serial_SetSerialSettings,
        LPC1788_Serial_GetSerialSettings,
        LPC1788_Serial_Activate,
        LPC1788_Serial_Deactivate,
        LPC1788_Serial_OutputByte,
        0,
        0,
        LPC1788_Serial_GetStatus, };

const HAL_Serial G_LPC1788_Serial_UART3 = {
        {
        "Serial:LCP1788 UART3",
        0x0100,
        LPC1788_Serial_InitializeWorkspace_UART3,
        sizeof(T_Serial_LPC1788_Workspace),
        },

        LPC1788_Serial_Configure,
        LPC1788_Serial_SetSerialSettings,
        LPC1788_Serial_GetSerialSettings,
        LPC1788_Serial_Activate,
        LPC1788_Serial_Deactivate,
        LPC1788_Serial_OutputByte,
        0,
        0,
        LPC1788_Serial_GetStatus, };

const T_Serial_LPC1788_SerialInfo G_LPC1788_Serial_Info_UART0 = {
        UART0_IRQn,
        INTERRUPT_PRIORITY_HIGH,
        (T_16550UART *)LPC_UART0_BASE,
        (TISRFPtr)ISerialUART0,
        3, // PCUART0
        };

const T_Serial_LPC1788_SerialInfo G_LPC1788_Serial_Info_UART1 = {
        UART1_IRQn,
        INTERRUPT_PRIORITY_HIGH,
        (T_16550UART *)LPC_UART1_BASE,
        (TISRFPtr)ISerialUART1,
        4, // PCUART1
        };

const T_Serial_LPC1788_SerialInfo G_LPC1788_Serial_Info_UART2 = {
        UART2_IRQn,
        INTERRUPT_PRIORITY_HIGH,
        (T_16550UART *)LPC_UART2_BASE,
        (TISRFPtr)ISerialUART2,
        24, // PCUART2
        };

const T_Serial_LPC1788_SerialInfo G_LPC1788_Serial_Info_UART3 = {
        UART3_IRQn,
        INTERRUPT_PRIORITY_HIGH,
        (T_16550UART *)LPC_UART3_BASE,
        (TISRFPtr)ISerialUART3,
        25, // PCUART3
        };

/*---------------------------------------------------------------------------*
 * Requirement routines:
 *---------------------------------------------------------------------------*/
void LPC1788_UART0_Require(
        T_uezGPIOPortPin aPinTXD0,
        T_uezGPIOPortPin aPinRXD0)
{
    static const T_LPC1788_IOCON_ConfigList txd0[] = {
            {GPIO_P0_0,   IOCON_D_DEFAULT(4)},
            {GPIO_P0_2,   IOCON_D_DEFAULT(1)},
    };
    static const T_LPC1788_IOCON_ConfigList rxd0[] = {
            {GPIO_P0_1,   IOCON_D_DEFAULT(4)},
            {GPIO_P0_3,   IOCON_D_DEFAULT(1)},
    };

    HAL_DEVICE_REQUIRE_ONCE();
    HALInterfaceRegister("UART0", (T_halInterface *)&G_LPC1788_Serial_UART0, 0,
            0);
    LPC1788_IOCON_ConfigPinOrNone(aPinTXD0, txd0, ARRAY_COUNT(txd0));
    LPC1788_IOCON_ConfigPinOrNone(aPinRXD0, rxd0, ARRAY_COUNT(rxd0));
}

void LPC1788_UART1_Require(
        T_uezGPIOPortPin aPinTXD1,
        T_uezGPIOPortPin aPinRXD1,
        T_uezGPIOPortPin aPinCTS,
        T_uezGPIOPortPin aPinDCD,
        T_uezGPIOPortPin aPinDSR,
        T_uezGPIOPortPin aPinDTR,
        T_uezGPIOPortPin aPinRI,
        T_uezGPIOPortPin aPinRTS)
{
    static const T_LPC1788_IOCON_ConfigList txd1[] = {
            {GPIO_P0_15, IOCON_D_DEFAULT(1)},
            {GPIO_P2_0,  IOCON_D_DEFAULT(2)},
            {GPIO_P3_16, IOCON_D_DEFAULT(3)},
    };
    static const T_LPC1788_IOCON_ConfigList rxd1[] = {
            {GPIO_P0_16, IOCON_D_DEFAULT(1)},
            {GPIO_P2_1,  IOCON_D_DEFAULT(2)},
            {GPIO_P3_17, IOCON_D_DEFAULT(3)},
    };
    static const T_LPC1788_IOCON_ConfigList cts[] = {
            {GPIO_P0_17, IOCON_D_DEFAULT(1)},
            {GPIO_P2_2,  IOCON_D_DEFAULT(2)},
            {GPIO_P2_8,  IOCON_D_DEFAULT(3)},
            {GPIO_P3_18, IOCON_D_DEFAULT(3)},
    };
    static const T_LPC1788_IOCON_ConfigList dcd[] = {
            {GPIO_P0_18, IOCON_D_DEFAULT(1)},
            {GPIO_P2_3,  IOCON_D_DEFAULT(2)},
            {GPIO_P3_19, IOCON_D_DEFAULT(3)},
    };
    static const T_LPC1788_IOCON_ConfigList dsr[] = {
            {GPIO_P0_19, IOCON_D_DEFAULT(1)},
            {GPIO_P2_4,  IOCON_D_DEFAULT(2)},
            {GPIO_P3_20, IOCON_D_DEFAULT(3)},
    };
    static const T_LPC1788_IOCON_ConfigList dtr[] = {
            {GPIO_P0_20, IOCON_D_DEFAULT(1)},
            {GPIO_P2_5,  IOCON_D_DEFAULT(2)},
            {GPIO_P3_21, IOCON_D_DEFAULT(3)},
    };
    static const T_LPC1788_IOCON_ConfigList ri[] = {
            {GPIO_P0_21, IOCON_D_DEFAULT(1)},
            {GPIO_P2_6,  IOCON_D_DEFAULT(2)},
            {GPIO_P3_22, IOCON_D_DEFAULT(3)},
    };
    static const T_LPC1788_IOCON_ConfigList rts[] = {
            {GPIO_P0_6,  IOCON_D_DEFAULT(4)},
            {GPIO_P0_22, IOCON_D_DEFAULT(1)},
            {GPIO_P2_7,  IOCON_D_DEFAULT(2)},
            {GPIO_P3_30, IOCON_D_DEFAULT(3)},
    };

    HAL_DEVICE_REQUIRE_ONCE();
    HALInterfaceRegister("UART1", (T_halInterface *)&G_LPC1788_Serial_UART1, 0,
            0);
    LPC1788_IOCON_ConfigPinOrNone(aPinTXD1, txd1, ARRAY_COUNT(txd1));
    LPC1788_IOCON_ConfigPinOrNone(aPinRXD1, rxd1, ARRAY_COUNT(rxd1));
    LPC1788_IOCON_ConfigPinOrNone(aPinCTS, cts, ARRAY_COUNT(cts));
    LPC1788_IOCON_ConfigPinOrNone(aPinDCD, dcd, ARRAY_COUNT(dcd));
    LPC1788_IOCON_ConfigPinOrNone(aPinDSR, dsr, ARRAY_COUNT(dsr));
    LPC1788_IOCON_ConfigPinOrNone(aPinDTR, dtr, ARRAY_COUNT(dtr));
    LPC1788_IOCON_ConfigPinOrNone(aPinRI, ri, ARRAY_COUNT(ri));
    LPC1788_IOCON_ConfigPinOrNone(aPinRTS, rts, ARRAY_COUNT(rts));
}

